Revit 2027 API
BuiltInFailures.DecalFailures.LongerThanPossible Property
 Decal element is longer than the circumference of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LongerThanPossible { get; }
Public Shared ReadOnly Property LongerThanPossible As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LongerThanPossible {
	FailureDefinitionId^ get ();
}
static member LongerThanPossible : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DecalFailures Class
Autodesk.Revit.DB Namespace